public class 이모티콘할인행사 {
    public static void main(String[] args) {
        /**
         - 목표 ::
         1) 이모티콘 플러스 서비스 가입자를 최대한 늘리는 것 <1>
         2) 이모티콘 판매액을 최대한 늘리는 것 <2>

         - 방식 ::
         1) n명의 카카오톡 사용자에게 이모티콘 m개를 할인 판매
         2) 할인율은 10%, 20%, 30%, 40% 중 하나로 설정

         - 카카오톡 사용자가 이모티콘 구매, 이모티콘 플러스 서비스에 가입할 방법
         1) 자신의 기준에 따라
            [일정 비율 이상 할인]하는 [이모티콘을 모두 구매]
         2) 자신의 기준에 따라
            [이모티콘 구매 비용의 합]이 [일정 가격 이상]이 된다면,
            이모티콘 구매를 모두 [취소]하고 [이모티콘 플러스 서비스에 가입]

         - 해결 방법::
         1) 할인율 입력
         2) 구매 비용 제한 입력
         3) 이모티콘 플러스

         test
         
         **/
    }
}
